---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorExtractCurveData
source: html/d426ca7c-b50a-3a83-57d9-0743bdc5c316.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorExtractCurveData Property

The calculation could not be performed. Verify the pump curve data.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkErrorExtractCurveData { get; }
```